Tekla.Structures.Catalogs.MaterialMarketSizesItem
The MaterialMarketSizesItem class contains information about the available market sizes for particular material.

Tekla.Structures.Catalogs.MaterialMarketSizesItem.MaterialName
Material name

Tekla.Structures.Catalogs.MaterialMarketSizesItem.MarketSizes
Available MarketSizes for the particular material

Tekla.Structures.Catalogs.MaterialMarketSizesItem.#ctor
Creates a default MaterialMarketSizesItem instance

Tekla.Structures.Catalogs.MaterialMarketSizesItem.#ctor(System.String,System.Double[])
Creates a new MaterialMarketSizesItem instance
materialName: Name of the material
marketSizes: Available market sizes for the particular material